trade_exp/src/InformationRegisters/СрокиПоставкиТовараОтПоставщика/СрокиПоставкиТовараОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="01ebca2b-ec78-4ea4-9e82-48d214661961">
  <name>СрокиПоставкиТовараОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="563fc7a2-225f-4731-b431-0173837e79ad">
    <name>МинимальныйСрокПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4436ceb3-5e82-47ca-845a-fa217895ec02">
    <name>МаксимальныйСрокПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="e6c9c4eb-62f5-47e8-aaa9-a606c264af37">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="5b3791b7-16d5-4a4c-b975-3b6d4c2834cd">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e2b8bef6-3abc-4f45-8fa0-2e3316ca15af">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СрокиПоставкиТовараОтПоставщика/Forms/Док_ФормаСписка/Module.bsl
&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ТекущиеДанные Тогда
		ПриСозданииНаСервере(Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтотОбъект);
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		ОткрытьФорму("РегистрСведений.СрокиПоставкиТовараОтПоставщика.ФормаЗаписи", Новый Структура("Номенклатура", Список.Отбор.Элементы[0].ПравоеЗначение), ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("РегистрСведений.СрокиПоставкиТовараОтПоставщика.ФормаЗаписи",, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте 
Процедура ПослеСоздания(Результат, ДополнительныеПараметры) Экспорт

	Элементы.Список.Обновить();

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") тогда	
		
		Номенклатура = Параметры.Номенклатура;
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.История;
		Иначе	 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Номенклатура, ВидСравненияКомпоновкиДанных.Равно);
			ТаблицаТекущихДанных.Очистить();
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.Подразделение КАК Подразделение,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.МинимальныйСрокПоставки КАК МинимальныйСрокПоставки,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.МаксимальныйСрокПоставки КАК МаксимальныйСрокПоставки,
							|	СрокиПоставкиТовараОтПоставщикаСрезПоследних.Подразделение.Код КАК ПодразделениеКод
							|ИЗ
							|	РегистрСведений.СрокиПоставкиТовараОтПоставщика.СрезПоследних(, Номенклатура = &Номенклатура) КАК СрокиПоставкиТовараОтПоставщикаСрезПоследних
							|
							|УПОРЯДОЧИТЬ ПО
							|	ПодразделениеКод";
			Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") тогда
				Номенклатура = Параметры.Отбор.Номенклатура;
			ИначеЕсли   Список.Отбор.Элементы.Количество() > 0 тогда
				Номенклатура = Список.Отбор.Элементы[0].ПравоеЗначение;
			Иначе 
				Возврат;
			КонецЕсли;
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
			ТаблицаТекущихДанных.Загрузить(ТаблицаЗначений);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
